app/views/static_pages/dashboard.html.erb

SELECT COUNT(*) FROM "units"
---
                        <div class="col-xs-9 text-right">
                            <div class="huge"><%= Unit.all.count %></div>