app/views/units/index.html.erb

                    <% @units.each do |base| %>
                    <% unit = Unit.find_by(unit_number: base) %>
---
SELECT  "units".* FROM "units" WHERE "units"."unit_number" = $1  ORDER BY "units"."updated_at" DESC LIMIT 1  [["unit_number", "864639473-5"]]