app/controllers/code_scan_controller.rb

INSERT INTO "units" ("unit_number", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["unit_number", "test"], ["created_at", "2015-10-25 03:39:01.786488"], ["updated_at", "2015-10-25 03:39:01.786488"]]
---
  def scan_code_get
    render text: "Success"
    Unit.new(unit_number: "get test").save