app/controllers/units_controller.rb

SELECT  "units".* FROM "units"  ORDER BY "units"."id" ASC LIMIT 1
SELECT  "units".* FROM "units" WHERE "units"."unit_number" = $1  ORDER BY "units"."updated_at" DESC LIMIT 1  [["unit_number", "864639473-5"]]
---
  def index
    noAdd = []
    noAdd << Unit.first
    Unit.order(:unit_number).all.each do |unit|

SELECT  "units".* FROM "units" WHERE (unit_number LIKE )  ORDER BY "units"."id" ASC LIMIT 1
---
    def set_unit
      @unit = Unit.find(params[:id])