app/controllers/units_controller.rb

SELECT  DISTINCT "units"."unit_number" FROM "units" WHERE "id"."unit_number" IS NULL LIMIT 1
---
  def index
    @units = Unit.uniq.pluck(:unit_number)

SELECT "units".* FROM "units"  ORDER BY "units"."updated_at" ASC
---
  def all
    @units = Unit.order(:updated_at).all.reverse

SELECT "units".* FROM "units"
---
  def search
    number = params[:search]
    @units = []
    Unit.all.each do |unit|